const arr = [1, 2, 3, 4, 5, 6, 7]
const arr2 = arr.splice(0, 4) 

console.log(arr2)
console.log(arr)

/**
 * η splice βασικα κανει delete αλλα με εναν εξυπνο τροπο κανει και insert και update.
 * παιρνει 2 παραμετρους. απο ποια θεση να ξεκινησει και το πληθος των στοιχειων που θα διαγραψει.
 * τροποποιει τον αρχικο πινακα και επιστρρεφει εναν πινακα με τα στοιχεια
 * που διεγραψε απο τον αρχικο
 */

//Insert
arr.splice(0, 0, 10) // στη θεση 0, διαγραφει 0 στοιχεια και κανει insert την τριτη παραμετρο και τα υπολοιπα στοιχεια τα κανει shift right
console.log(arr)

//Update
arr.splice(0, 1, 11)  // το ιδιο με πριν αλλα κανει και μια διαγραφη οποτε ειναι update